benchmark/results/v0.6/throughput_mc-vs-rust/RAW/actix_web-plaintext-throughput_mc-cal-175418.txt
Running 10s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.29ms  610.61us  11.86ms   67.40%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.25ms
 75.000%    1.69ms
 90.000%    2.09ms
 99.000%    2.61ms
 99.900%    4.53ms
 99.990%   10.36ms
 99.999%   11.49ms
100.000%   11.86ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.027     0.000000            1         1.00
       0.545     0.100000       172711         1.11
       0.755     0.200000       344443         1.25
       0.935     0.300000       516373         1.43
       1.095     0.400000       688548         1.67
       1.249     0.500000       860320         2.00
       1.329     0.550000       947028         2.22
       1.411     0.600000      1032730         2.50
       1.496     0.650000      1118354         2.86
       1.587     0.700000      1204237         3.33
       1.689     0.750000      1290525         4.00
       1.746     0.775000      1333587         4.44
       1.807     0.800000      1376672         5.00
       1.872     0.825000      1419565         5.71
       1.941     0.850000      1462664         6.67
       2.013     0.875000      1505456         8.00
       2.051     0.887500      1526863         8.89
       2.091     0.900000      1548438        10.00
       2.133     0.912500      1569746        11.43
       2.179     0.925000      1591737        13.33
       2.229     0.937500      1613515        16.00
       2.255     0.943750      1623882        17.78
       2.283     0.950000      1634395        20.00
       2.315     0.956250      1645200        22.86
       2.349     0.962500      1655737        26.67
       2.389     0.968750      1666650        32.00
       2.411     0.971875      1672066        35.56
       2.435     0.975000      1677459        40.00
       2.461     0.978125      1682627        45.71
       2.491     0.981250      1688139        53.33
       2.525     0.984375      1693506        64.00
       2.545     0.985938      1696229        71.11
       2.567     0.987500      1698913        80.00
       2.591     0.989062      1701544        91.43
       2.619     0.990625      1704225       106.67
       2.649     0.992188      1706758       128.00
       2.667     0.992969      1708126       142.22
       2.689     0.993750      1709537       160.00
       2.713     0.994531      1710823       182.86
       2.741     0.995313      1712193       213.33
       2.773     0.996094      1713480       256.00
       2.793     0.996484      1714184       284.44
       2.815     0.996875      1714835       320.00
       2.841     0.997266      1715508       365.71
       2.873     0.997656      1716199       426.67
       2.911     0.998047      1716838       512.00
       2.943     0.998242      1717173       568.89
       2.981     0.998437      1717508       640.00
       3.049     0.998633      1717841       731.43
       3.513     0.998828      1718177       853.33
       4.655     0.999023      1718513      1024.00
       5.263     0.999121      1718682      1137.78
       5.815     0.999219      1718850      1280.00
       6.487     0.999316      1719018      1462.86
       7.135     0.999414      1719187      1706.67
       7.751     0.999512      1719354      2048.00
       8.059     0.999561      1719437      2275.56
       8.375     0.999609      1719522      2560.00
       8.687     0.999658      1719608      2925.71
       9.031     0.999707      1719690      3413.33
       9.335     0.999756      1719776      4096.00
       9.495     0.999780      1719816      4551.11
       9.671     0.999805      1719859      5120.00
       9.823     0.999829      1719899      5851.43
       9.991     0.999854      1719941      6826.67
      10.191     0.999878      1719983      8192.00
      10.311     0.999890      1720005      9102.22
      10.383     0.999902      1720025     10240.00
      10.439     0.999915      1720047     11702.86
      10.575     0.999927      1720067     13653.33
      10.703     0.999939      1720088     16384.00
      10.751     0.999945      1720098     18204.44
      10.799     0.999951      1720110     20480.00
      10.895     0.999957      1720119     23405.71
      10.975     0.999963      1720130     27306.67
      11.135     0.999969      1720141     32768.00
      11.175     0.999973      1720146     36408.89
      11.199     0.999976      1720151     40960.00
      11.239     0.999979      1720156     46811.43
      11.303     0.999982      1720161     54613.33
      11.359     0.999985      1720166     65536.00
      11.383     0.999986      1720170     72817.78
      11.463     0.999988      1720172     81920.00
      11.479     0.999989      1720174     93622.86
      11.495     0.999991      1720178    109226.67
      11.503     0.999992      1720179    131072.00
      11.511     0.999993      1720181    145635.56
      11.535     0.999994      1720183    163840.00
      11.535     0.999995      1720183    187245.71
      11.607     0.999995      1720185    218453.33
      11.663     0.999996      1720186    262144.00
      11.671     0.999997      1720187    291271.11
      11.671     0.999997      1720187    327680.00
      11.687     0.999997      1720188    374491.43
      11.711     0.999998      1720189    436906.67
      11.711     0.999998      1720189    524288.00
      11.727     0.999998      1720190    582542.22
      11.727     0.999998      1720190    655360.00
      11.727     0.999999      1720190    748982.86
      11.751     0.999999      1720191    873813.33
      11.751     0.999999      1720191   1048576.00
      11.751     0.999999      1720191   1165084.44
      11.751     0.999999      1720191   1310720.00
      11.751     0.999999      1720191   1497965.71
      11.863     0.999999      1720192   1747626.67
      11.863     1.000000      1720192          inf
#[Mean    =        1.292, StdDeviation   =        0.611]
#[Max     =       11.856, Total count    =      1720192]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1720256 requests in 10.00s, 213.27MB read
Requests/sec: 172018.62
Transfer/sec:     21.33MB