benchmark/results/v0.6/throughput_mc-vs-rust/RAW/flare-plaintext-throughput_mc-cal-54815.txt
Running 10s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   103.93ms   37.23ms 155.90ms   67.38%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  112.89ms
 75.000%  135.29ms
 90.000%  144.00ms
 99.000%  152.32ms
 99.900%  154.75ms
 99.990%  155.39ms
 99.999%  155.65ms
100.000%  156.03ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.061     0.000000            1         1.00
      42.911     0.100000        53583         1.11
      72.767     0.200000       107238         1.25
      91.199     0.300000       160934         1.43
     102.143     0.400000       214635         1.67
     112.895     0.500000       268163         2.00
     117.375     0.550000       294813         2.22
     121.343     0.600000       321697         2.50
     126.719     0.650000       348455         2.86
     131.967     0.700000       375415         3.33
     135.295     0.750000       402146         4.00
     136.703     0.775000       415388         4.44
     138.111     0.800000       428991         5.00
     139.519     0.825000       442768         5.71
     141.055     0.850000       456479         6.67
     142.463     0.875000       469132         8.00
     143.231     0.887500       476115         8.89
     143.999     0.900000       482696        10.00
     144.767     0.912500       489058        11.43
     145.663     0.925000       495689        13.33
     146.687     0.937500       502513        16.00
     147.199     0.943750       505791        17.78
     147.711     0.950000       509384        20.00
     148.223     0.956250       513048        22.86
     148.607     0.962500       515974        26.67
     149.247     0.968750       519567        32.00
     149.503     0.971875       520959        35.56
     149.887     0.975000       522781        40.00
     150.271     0.978125       524210        45.71
     150.783     0.981250       526020        53.33
     151.295     0.984375       527695        64.00
     151.551     0.985938       528489        71.11
     151.807     0.987500       529248        80.00
     152.063     0.989062       530053        91.43
     152.319     0.990625       530799       106.67
     152.703     0.992188       531801       128.00
     152.831     0.992969       532095       142.22
     153.087     0.993750       532597       160.00
     153.343     0.994531       533124       182.86
     153.471     0.995313       533400       213.33
     153.727     0.996094       534019       256.00
     153.727     0.996484       534019       284.44
     153.855     0.996875       534338       320.00
     153.983     0.997266       534505       365.71
     154.111     0.997656       534716       426.67
     154.239     0.998047       534854       512.00
     154.367     0.998242       534961       568.89
     154.495     0.998437       535067       640.00
     154.623     0.998633       535187       731.43
     154.623     0.998828       535187       853.33
     154.751     0.999023       535383      1024.00
     154.751     0.999121       535383      1137.78
     154.879     0.999219       535497      1280.00
     154.879     0.999316       535497      1462.86
     154.879     0.999414       535497      1706.67
     155.007     0.999512       535582      2048.00
     155.007     0.999561       535582      2275.56
     155.135     0.999609       535655      2560.00
     155.135     0.999658       535655      2925.71
     155.135     0.999707       535655      3413.33
     155.263     0.999756       535742      4096.00
     155.263     0.999780       535742      4551.11
     155.263     0.999805       535742      5120.00
     155.263     0.999829       535742      5851.43
     155.263     0.999854       535742      6826.67
     155.391     0.999878       535772      8192.00
     155.391     0.999890       535772      9102.22
     155.391     0.999902       535772     10240.00
     155.391     0.999915       535772     11702.86
     155.391     0.999927       535772     13653.33
     155.519     0.999939       535802     16384.00
     155.519     0.999945       535802     18204.44
     155.519     0.999951       535802     20480.00
     155.519     0.999957       535802     23405.71
     155.519     0.999963       535802     27306.67
     155.519     0.999969       535802     32768.00
     155.519     0.999973       535802     36408.89
     155.519     0.999976       535802     40960.00
     155.519     0.999979       535802     46811.43
     155.519     0.999982       535802     54613.33
     155.519     0.999985       535802     65536.00
     155.647     0.999986       535805     72817.78
     155.647     0.999988       535805     81920.00
     155.647     0.999989       535805     93622.86
     155.775     0.999991       535809    109226.67
     155.775     0.999992       535809    131072.00
     155.775     0.999993       535809    145635.56
     155.775     0.999994       535809    163840.00
     155.775     0.999995       535809    187245.71
     155.775     0.999995       535809    218453.33
     155.775     0.999996       535809    262144.00
     155.775     0.999997       535809    291271.11
     155.775     0.999997       535809    327680.00
     155.775     0.999997       535809    374491.43
     155.775     0.999998       535809    436906.67
     155.775     0.999998       535809    524288.00
     156.031     0.999998       535810    582542.22
     156.031     1.000000       535810          inf
#[Mean    =      103.931, StdDeviation   =       37.232]
#[Max     =      155.904, Total count    =       535810]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  535818 requests in 10.00s, 59.79MB read
Requests/sec:  53584.43
Transfer/sec:      5.98MB